IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_sec_bm.cpp
/**-------------------------------------------------------------------------
@file	bt_sec_bm.cpp

@brief	IOsonata security manager for the sdk-nrf-bm SoftDevice path (nRF54L).

		Replaces the sdk-nrf-bm peer_manager modules security_manager.c and
		security_dispatcher.c with one module, the same shape as the nRF52
		implementation bt_sec_sd.cpp. It implements the sm_* API surface peer_manager.c
		calls (security_manager.h), provides smd_init (peer_manager.c calls it
		right after sm_init), emits the same struct pm_evt events through
		pm_sm_evt_handler, and drives the S145 SoftDevice GAP security
		procedures directly. The peer data layer stays in place: peer_database,
		peer_id and the IOsonata peer_data_storage replacement are used
		unchanged, so bond records keep their layout.

		LESC runs on the IOsonata BtLesc module (OO KeyAgreeEngine based),
		wired where the stock module called the lesc layer: init in sm_init,
		the public key at the params reply, event delivery at the end of
		sm_ble_evt_handler. DHKey computation stays deferred to
		BtLescRequestHandler in the application main loop.

		The keyset handed to sd_ble_gap_sec_params_reply points into the
		pm_peer_data_bonding inside the peer_database write buffer, so the
		SoftDevice writes the distributed keys straight into the structure the
		store commits at AUTH_STATUS with pdb_write_buf_store.

		Fixes carried over from the nRF52 implementation, all applying here too:
		- Per-connection state record. The stock dispatcher shares one static
		  LESC peer public key buffer across links, so concurrent pairings
		  overwrite each other. Here each link owns its receive buffer.
		- The pending params reply preserves the exact application answer,
		  including a rejection, across an NRF_ERROR_BUSY retry; the stock
		  module loses it.
		- Re-pairing denied at AUTH_STATUS disconnects the link instead of
		  reporting success while it stays encrypted with a key the
		  application refused. The early reject at params-reply time (a stock
		  sdk-nrf-bm improvement over the frozen nRF5 SDK) is kept as well.
		- SIG policy the stock module never offered: Secure Connections Only
		  rejects legacy pairing with Authentication Requirements (Core Vol 3
		  Part H 2.3.5.1); the minimum encryption key size is checked on
		  every CONN_SEC_UPDATE and an under-keyed link is failed and
		  disconnected (KNOB class downgrade mitigation).
		- Connection handle recycling: the whole per-link record is reset at
		  BLE_GAP_EVT_CONNECTED.
		- A bond store hitting NRF_ERROR_BUSY is deferred and retried by the
		  pending pumps, so the terminal pairing event reports a truthful
		  data_stored. NRF_ERROR_RESOURCES emits PM_EVT_STORAGE_FULL and
		  reports the store as accepted, matching the stock module.

		Divergence from stock kept on purpose: a central securing a link with
		a known peer id but no readable bond data (NRF_ERROR_NOT_FOUND) falls
		back to pairing instead of failing, matching the nRF52 implementation.

		Both roles are implemented, each gated by its SoftDevice variant
		option (CONFIG_SOFTDEVICE_PERIPHERAL / CONFIG_SOFTDEVICE_CENTRAL).
		Runs entirely in the pm BLE event dispatch context, the same as the
		stock modules it replaces.

@author	Hoang Nguyen Hoan
@date	Jul. 14, 2026

@license

MIT License

Copyright (c) 2026, I-SYST, all rights reserved

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
----------------------------------------------------------------------------*/
#include <string.h>

#include <nrf_error.h>
#include <ble.h>
#include <ble_gap.h>
#include <ble_err.h>
#include <ble_hci.h>

#include <zephyr/logging/log.h>

#include <bm/softdevice_handler/nrf_sdh_ble.h>
#include <bm/bluetooth/peer_manager/peer_manager_types.h>

#include <modules/peer_manager_internal.h>
#include <modules/security_manager.h>		// the sm_* API this module implements
#include <modules/security_dispatcher.h>	// smd_init, called by pm_init; the rest
											// of the smd layer is absorbed here
#include <modules/conn_state.h>
#include <modules/peer_database.h>
#include <modules/peer_data_storage.h>
#include <modules/id_manager.h>

#if defined(CONFIG_PM_RA_PROTECTION)
#include <modules/auth_status_tracker.h>
#endif

#include "bt_lesc.h"

LOG_MODULE_DECLARE(peer_manager, CONFIG_PEER_MANAGER_LOG_LEVEL);

// Event sink in peer_manager.c; the same extern hookup the stock sm uses.
extern "C" void pm_sm_evt_handler(struct pm_evt *sm_evt);

// The context type used in PM_EVT_CONN_SEC_PARAMS_REQ events and in calls to
// sm_sec_params_reply(). The application interacts with it only through
// sm_sec_params_reply.
typedef struct {
	ble_gap_sec_params_t *pSecParams;		// params to use in the reply
	ble_gap_sec_params_t  SecParamsMem;		// buffer holding the params
	bool                  bReplyCalled;		// sm_sec_params_reply was called
} SecParamsReplyCtx_t;

static bool                  s_bInit;
static ble_gap_sec_params_t  s_SecParams;	// default sec params buffer
static ble_gap_sec_params_t *s_pSecParams;	// NULL until sm_sec_params_set

