IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_sec_bm.cpp
		if (secStatus == BLE_GAP_SEC_STATUS_SUCCESS)
		{
			if (!pSecParams->bond)
			{
				// Pairing without bonding: no store buffer, but the LESC
				// public key exchange still needs its buffers.
				BtSecBmLink_t *pLink = LinkGet(ConnHdl);
				if (pLink == nullptr)
				{
					return BLE_ERROR_INVALID_CONN_HANDLE;
				}
				keyset.keys_own.p_pk  = LescPubKeyGet();
				keyset.keys_peer.p_pk = &pLink->PeerPk;
			}
			else
			{
				r = SecKeysetFill(ConnHdl, role, &keyset);
				if (r != NRF_SUCCESS)
				{
					pm_conn_state_user_flag_set(ConnHdl, s_FlagReplyPendBusy,
												r == NRF_ERROR_BUSY);
					return r;
				}
				bWriteBufHeld = true;
			}
		}
	}

	// Peripheral replies with its parameters; a central gave them at
	// sd_ble_gap_authenticate. The keyset is always passed, zeroed on reject.
	ble_gap_sec_params_t *pReplyParams = NULL;
#if defined(CONFIG_SOFTDEVICE_PERIPHERAL)
	if (role == BLE_GAP_ROLE_PERIPH && secStatus == BLE_GAP_SEC_STATUS_SUCCESS)
	{
		pReplyParams = pSecParams;
	}
#endif

	r = sd_ble_gap_sec_params_reply(ConnHdl, secStatus, pReplyParams, &keyset);
	pm_conn_state_user_flag_set(ConnHdl, s_FlagReplyPendBusy, r == NRF_ERROR_BUSY);

	if (bWriteBufHeld && r != NRF_SUCCESS && r != NRF_ERROR_BUSY)
	{
		WriteBufRelease(ConnHdl);
	}

	if (r == NRF_ERROR_INVALID_STATE && !pm_conn_state_valid(ConnHdl))
	{
		return NRF_SUCCESS;		// link dropped; benign
	}
	// A live link returning INVALID_STATE is a sequencing defect (duplicate
	// reply, wrong phase) and surfaces to the caller.
	// NRF_ERROR_BUSY propagates: ReplyAttempt must see it to keep the exact
	// reply for the retry. Conversion to a success result for the public API
	// happens at the callers.
	return r;
}

// Perform a reply and keep the exact answer, including a rejection, for the
// BUSY retry. On a terminal result the pending record is cleared.
static uint32_t ReplyAttempt(uint16_t ConnHdl, ble_gap_sec_params_t *pSecParams)
{
	uint32_t r = ParamsReplyPerform(ConnHdl, pSecParams);
	BtSecBmLink_t *pLink = LinkGet(ConnHdl);

	if (pLink != nullptr)
	{
		if (r == NRF_ERROR_BUSY)
		{
			pLink->bReplyReject = (pSecParams == NULL);
			if (pSecParams != NULL)
			{
				pLink->ReplyParams = *pSecParams;
			}
			pLink->bReplyValid = true;
		}
		else
		{
			pLink->bReplyValid  = false;
			pLink->bReplyReject = false;
		}
	}
	return r;
}

// PM_EVT_CONN_SEC_PARAMS_REQ handling: emit the event with a reply context; if
// the application does not answer within its handler through
// sm_sec_params_reply, reply with the context (default) parameters.
static void ParamsRequestProcess(uint16_t ConnHdl, const ble_gap_sec_params_t *pPeerParams)
{
	SecParamsReplyCtx_t ctx;

	ctx.pSecParams   = s_pSecParams;
	ctx.bReplyCalled = false;

	struct pm_evt evt = NewEvt(PM_EVT_CONN_SEC_PARAMS_REQ, ConnHdl);
	evt.conn_sec_params_req.peer_params = pPeerParams;
	evt.conn_sec_params_req.context     = &ctx;
	EvtSend(&evt);

	if (!ctx.bReplyCalled)
	{
		uint32_t r = ReplyAttempt(ConnHdl, ctx.pSecParams);
		if (r != NRF_SUCCESS && r != NRF_ERROR_BUSY)
		{
			UnexpectedErrorSend(ConnHdl, r);
		}
	}
}

// ---- link secure (pm_conn_secure and Security Request) ----------------------

#if defined(CONFIG_SOFTDEVICE_CENTRAL)
static uint32_t LinkSecureCentralEncrypt(uint16_t ConnHdl, uint16_t PeerId)
{
	struct pm_peer_data_bonding bondData;
	struct pm_peer_data peerData;
	const uint32_t bufSize = sizeof(bondData);
	const ble_gap_enc_key_t *pKey = NULL;

	memset(&bondData, 0, sizeof(bondData));
	peerData.bonding_data = &bondData;

	uint32_t r = pds_peer_data_read(PeerId, PM_PEER_DATA_ID_BONDING,
									&peerData, &bufSize);
	if (r == NRF_SUCCESS)
	{
		// Peer distributed its LTK as peripheral; for LESC both sides hold
		// the same LTK under own_ltk.
		pKey = &bondData.peer_ltk;
		if (bondData.own_ltk.enc_info.lesc)
		{
			pKey = &bondData.own_ltk;
		}
		else if (!im_master_id_is_valid(&pKey->master_id))
		{
			pKey = NULL;		// no usable legacy key
		}
	}
	else if (r == NRF_ERROR_BUSY)
	{
		return NRF_ERROR_BUSY;	// storage busy; retried by the pump
	}
	else if (r != NRF_ERROR_NOT_FOUND)
	{
		return NRF_ERROR_INTERNAL;
	}

	if (pKey == NULL || !pKey->enc_info.ltk_len)
	{
		return NRF_ERROR_NOT_FOUND;		// no usable key; caller falls back to pairing
	}

	r = sd_ble_gap_encrypt(ConnHdl, &pKey->master_id, &pKey->enc_info);
	if (r == NRF_SUCCESS)
	{
		SecProcStart(ConnHdl, true, PM_CONN_SEC_PROCEDURE_ENCRYPTION);
	}
	return r;
}
#endif

static uint32_t LinkSecureAuthenticate(uint16_t ConnHdl, ble_gap_sec_params_t *pSecParams)
{
	uint32_t r = sd_ble_gap_authenticate(ConnHdl, pSecParams);

	if (r == NRF_SUCCESS)
	{
#if defined(CONFIG_SOFTDEVICE_CENTRAL)
		if (pm_conn_state_role(ConnHdl) == BLE_GAP_ROLE_CENTRAL && pSecParams != NULL)
		{
			SecProcStart(ConnHdl, true, pSecParams->bond ?
						 PM_CONN_SEC_PROCEDURE_BONDING : PM_CONN_SEC_PROCEDURE_PAIRING);
		}
#endif
		// Peripheral: this sends the Security Request; the procedure starts
		// at SEC_PARAMS_REQUEST when the central responds.
	}
	else if (r == NRF_ERROR_NO_MEM)
	{
		r = NRF_ERROR_BUSY;		// too many concurrent procedures; retried
	}
	return r;
}

static uint32_t LinkSecure(uint16_t ConnHdl, bool bNullParams, bool bForceRepairing,
						   bool bSendEvents)
{
	uint32_t              r;
	ble_gap_sec_params_t *pParams = bNullParams ? NULL : s_pSecParams;
	uint8_t               role = pm_conn_state_role(ConnHdl);

	if (role == BLE_GAP_ROLE_INVALID)
	{
		return BLE_ERROR_INVALID_CONN_HANDLE;
	}

#if defined(CONFIG_SOFTDEVICE_CENTRAL)
	if (role == BLE_GAP_ROLE_CENTRAL)
	{
		// Record the repairing decision at procedure start, stock behavior.
		pm_conn_state_user_flag_set(ConnHdl, s_FlagAllowRepairing, bForceRepairing);

		if (!bForceRepairing)
		{
			uint16_t peerId = im_peer_id_get_by_conn_handle(ConnHdl);

			if (peerId != PM_PEER_ID_INVALID)
			{
				r = LinkSecureCentralEncrypt(ConnHdl, peerId);
				if (r != NRF_ERROR_NOT_FOUND)
				{
					goto done;
				}
				// No stored key: fall through to pairing.
			}
		}
	}
#else
	(void)bForceRepairing;
#endif

